{
    "5": "",
    "5.2": "Dokumentierte Barrierefreiheitsfunktionen einer Webseite, wie Kontrasteinstellungen oder Versionen in Leichter Sprache, sollen für die betroffene Nutzendengruppe selbstständig identifizierbar und aktivierbar sein.",
    "5.3": "Wenn eine Webseite biometrische Merkmale zur Nutzeridentifizierung oder Steuerung nutzt, soll sie mindestens eine alternative nicht-biometrische oder biometrische Methode anbieten, damit Menschen mit Einschränkungen die Funktionen dennoch nutzen können.",
    "5.4": "Wenn eine Webseite Dokumente in andere Formate konvertiert, sollen vorhandene Barrierefreiheitsinformationen erhalten bleiben, sofern das Zielformat diese Informationen unterstützt.",

    "6": "",
    "6.1": "Webanwendungen mit Zwei-Wege-Sprachkommunikation sollen eine ausreichende Audioqualität gewährleisten, indem sie beim Kodieren und Dekodieren von Sprache einen Frequenzbereich von mindestens 7.000 Hz nutzen, um die Verständlichkeit zu verbessern, insbesondere für Menschen mit Hörbehinderungen.",
    "6.2.1.1": "Webangebote mit Zwei-Wege-Kommunikation, wie Sprach- oder Videotelefonie, sollen zusätzlich Echtzeit-Textkommunikation (RTT) ermöglichen, damit Nutzende Text bereits während der Eingabe übermitteln und empfangen können, ohne ihn explizit abschicken zu müssen.",
    "6.2.1.2": "Webanwendungen, die Zwei-Wege-Kommunikation und Echtzeit-Textkommunikation (RTT) anbieten, sollen ermöglichen, dass Sprache und Echtzeit-Text gleichzeitig genutzt werden können, sodass beide Kommunikationsformen gleichrangig behandelt werden.",
    "6.2.2.1": "Webangebote mit Echtzeit-Textkommunikation (RTT) sollen gesendete und empfangene Nachrichten visuell deutlich voneinander unterscheiden, damit Nutzende ihre eigenen und fremde Äußerungen leichter zuordnen können.",
    "6.2.2.2": "Webanwendungen mit Echtzeit-Textkommunikation (RTT) sollen die Sende- und Empfangsrichtung programmatisch unterscheidbar machen, damit Hilfsmittel wie Screenreader eigene und fremde Nachrichten korrekt identifizieren können.",
    "6.2.2.3": "Webanwendungen mit Echtzeit-Textkommunikation (RTT) sollen Sprechende, die Text nutzen, ebenso identifizierbar machen wie jene, die Sprache verwenden, damit alle Teilnehmenden gleichrangig wahrgenommen werden können.",
    "6.2.2.4": "Webanwendungen mit Zwei-Wege-Sprachkommunikation und Echtzeit-Textkommunikation (RTT) sollen in Echtzeit visuell anzeigen, wenn jemand spricht, und diese Information auch programmatisch ermittelbar machen, damit sie von Hilfsmitteln wie Braillezeilen genutzt werden kann.",
    "6.2.3": "Webanwendungen mit Echtzeit-Textkommunikation (RTT) sollen anerkannte technische Standards unterstützen, damit sie interoperabel mit anderen Anwendungen sind und die Echtzeit-Textübertragung zuverlässig funktioniert.",
    "6.2.4": "Webanwendungen mit Echtzeit-Textkommunikation (RTT) sollen eingegebene Zeichen oder Wörter innerhalb von maximal 500 Millisekunden an den Empfänger übertragen, um eine flüssige und gleichwertige Kommunikation zu gewährleisten.",
    "6.3": "Webanwendungen mit Telekommunikationsfunktionen und Anrufidentifizierung sollen die Identität des Anrufenden in Textform anzeigen und programmatisch ermittelbar machen, damit sie auch von Hilfsmitteln wie Screenreadern genutzt werden kann.",
    "6.4": "Webangebote mit Echtzeit-Sprachkommunikation, Voicemail oder interaktiven Sprachdialogsystemen sollen barrierefreie Alternativen bereitstellen, damit Aufgaben auch ohne Hören und Sprechen durchgeführt werden können.",
    "6.5.2": "Webanwendungen mit Videotelefonie-Funktion sollen mindestens eine QVGA-Auflösung (320x240 Pixel oder 76.800 Bildpunkte bei anderen Seitenverhältnissen) unterstützen, um eine ausreichende visuelle Verständlichkeit zu gewährleisten, insbesondere für gehörlose Menschen.",
    "6.5.3": "Webanwendungen mit Videotelefonie-Funktion sollen eine Bildwiederholfrequenz von mindestens 20 Bildern pro Sekunde unterstützen, um eine flüssige Darstellung zu gewährleisten, insbesondere für Menschen, die auf das Mundbild, Mimik und Gestik angewiesen sind.",
    "6.5.4": "Webanwendungen mit Videotelefonie-Funktion sollen sicherstellen, dass die Zeitdifferenz zwischen Audio und Video maximal 100 Millisekunden beträgt, um eine synchronisierte und verständliche Kommunikation zu ermöglichen, insbesondere für Menschen, die auf Lippenlesen oder Mimik angewiesen sind.",
    "6.5.5": "Webanwendungen mit Videotelefonie-Funktion sollen eine visuelle Anzeige für Audio-Aktivität bereitstellen, damit gehörlose Nutzende erkennen können, wenn und wer gerade spricht.",
    "6.5.6": "Webanwendungen mit Videotelefonie-Funktion sollen eine visuelle Anzeige für Gebärdensprach-Kommunikation bereitstellen, damit erkennbar ist, wenn und wer gerade in Gebärdensprache kommuniziert.",

    "7": "Anforderungen an Webinhalte mit Videoelementen zur Sicherstellung der Barrierefreiheit, einschließlich Untertitelung und Audiodeskription.",
    "7.1.1": "Webseiten mit Videos, die eine Bild- und Tonspur enthalten, sollen über einen Videoplayer verfügen, der textbasierte Untertitel (closed captions) ein- und ausblendbar macht, um Menschen mit Hörbeeinträchtigungen den Zugang zu den Inhalten zu ermöglichen.",
    "7.1.2": "Webseiten mit Videos, die Untertitel enthalten, sollen sicherstellen, dass die Untertitel synchron zum Ton dargestellt werden, sodass die Zeitabweichung maximal 100 Millisekunden beträgt, um eine gute Verständlichkeit zu gewährleisten.",
    "7.1.3": "Webseiten, die Videos mit Untertiteln übertragen, konvertieren oder aufnehmen, sollen sicherstellen, dass die Untertitel erhalten bleiben, sich weiterhin anzeigen lassen und synchron zum Ton dargestellt werden.",
    "7.1.4": "Webseiten mit Videos und zuschaltbaren Untertiteln (closed captions) sollen Nutzenden die Möglichkeit bieten, die Darstellung der Untertitel anzupassen, z. B. Schriftgröße, Farben oder Transparenz.",
    "7.1.5": "Webseiten mit Videos in einer fremden Sprache sollen für blinde und sehbehinderte Nutzende eine akustische Ausgabe der in der Hauptsprache verfügbaren Untertitel bereitstellen, z. B. über eine alternative Tonspur oder eine generierte Sprachausgabe.",
    "7.2.1": "Webseiten mit Videos, die eine Audiodeskription anbieten, sollen eine Möglichkeit zur Auswahl und Wiedergabe dieser Audiodeskription bereitstellen, entweder über ein Bedienelement im Player oder eine auswählbare Tonspur.",
    "7.2.2": "Webseiten mit Videos und Audiodeskription sollen sicherstellen, dass die Audiodeskription synchron zu Bild und Ton wiedergegeben wird, um eine verständliche und barrierefreie Nutzung zu ermöglichen.",
    "7.2.3": "Webseiten, die Videos mit Audiodeskription übertragen, konvertieren oder aufnehmen, sollen sicherstellen, dass die Audiodeskription erhalten bleibt, weiterhin zuschaltbar ist und synchron zu Bild und Ton wiedergegeben wird.",
    "7.3": "Videoplayer, die Videos mit Untertiteln oder Audiodeskription abspielen, sollen die Bedienelemente zur Aktivierung dieser Funktionen auf der gleichen Interaktionsebene wie die Wiedergabekontrollen (z. B. Abspielen, Pause, Lautstärke) bereitstellen, damit sie leicht zugänglich sind.",

    "9.1.1": "Textalternativen für nicht-textuelle Inhalte bereitstellen: z.B. Bilder, Grafiken, Videos, Audiodateien, CAPTCHAs ...",
    "9.1.1.1a": "Grafische Bedienelemente wie Icons, Logos oder Schaltflächen müssen mit sinnvoll beschreibenden Alternativtexten versehen sein. Formularbuttons müssen einen beschreibenden Wert haben und alle interaktiven Elemente sollten programmatisch identifizierbar sein.",
    "9.1.1.1b": "Nicht verlinkte informative Grafiken, Bilder und Multimedia-Objekte müssen aussagekräftige Alternativtexte haben. Für komplexe Bilder und Grafiken mit vielen Informationen sollten zusätzlich umfangreichere Beschreibungen bereitgestellt werden, entweder über ein longdesc-Attribut oder auf einer verlinkten separaten Seite.",
    "9.1.1.1c": "Layoutgrafiken und dekorative Bilder müssen mit einem leeren alt-Attribut (alt=\"\") ausgezeichnet werden, damit Screenreader sie ignorieren. Alternativ können sie auch als CSS-Hintergrundbilder implementiert werden, wenn sie keine inhaltliche Bedeutung haben.",
    "9.1.1.1d": "Bildbasierte CAPTCHAs müssen einen Alternativtext mit Zweckbeschreibung enthalten und mindestens eine barrierefreie Alternative bereitstellen. Dies kann ein Audiocaptcha, eine Logikaufgabe oder ein anderer zugänglicher Mechanismus sein, der nicht ausschließlich auf visuellen Fähigkeiten basiert.",

    "9.1.2": "Alternativen für zeitbasierte Medien bereitstellen: z.B. Film, Sprachaufzeichnung, Podcast, Animation ...",
    "9.1.2.1": "Audiodateien und stumme Videos müssen eine gleichwertige Medienalternative bieten. Für reine Audioinhalte (z.B. Podcasts, MP3-Dateien) muss ein beschreibendes Texttranskript bereitgestellt werden, das alle relevanten visuellen und auditiven Hinweise enthält. Für stumme Videos ist ein Text oder eine Audiobeschreibung erforderlich.",
    "9.1.2.2": "Aufgezeichnete Videos mit Ton müssen synchronisierte Untertitel enthalten oder eine gleichwertige Textalternative bieten. Diese Untertitel sollten sowohl Dialoge als auch wichtige Geräusche oder andere Audioelemente umfassen, die für das Verständnis des Inhalts relevant sind.",
    "9.1.2.3": "Informationstragende visuelle Videoinhalte müssen eine Audiodeskription oder eine Volltext-Alternative enthalten. Diese ist besonders wichtig, wenn das Video visuelle Inhalte zeigt, die nicht in der Standardtonspur enthalten sind, um blinden und sehbehinderten Nutzern einen gleichwertigen Zugang zu ermöglichen.",
    "9.1.2.4": "Live-Videos mit Ton müssen synchronisierte Untertitel enthalten, um die Informationen der Tonspur zugänglich zu machen. Dies gilt für alle Live-Multimedien mit Audioinhalt wie Webcasts, Videokonferenzen und Flash-Animationen.",
    "9.1.2.5": "Videos mit bedeutenden Bildinhalten müssen eine Audiodeskription enthalten, damit sie für blinde und sehbehinderte Menschen verständlich sind. Diese Anforderung ist besonders wichtig, wenn das Video visuelle Inhalte vermittelt, die nicht in der Standard-Tonspur verfügbar sind, wie wichtige Aktionen, Szenenwechsel, Texteinblendungen oder andere visuelle Informationen.",
    "1.2.6": "Für alle vorgefertigten Audioinhalte in synchronisierten Medien wird eine Gebärdensprachübersetzung bereitgestellt. Diese sollte als optionales Element einblendbar sein und von qualifizierten Gebärdensprachdolmetschern durchgeführt werden.",
    "1.2.7": "Wenn Pausen in der Vordergrund-Audio nicht ausreichen, um Audiobeschreibungen verständlich zu machen, wird eine erweiterte Audiobeschreibung für alle vorgefertigten Videoinhalte in synchronisierten Medien bereitgestellt. Dies kann eine alternative Version des Videos mit zusätzlichen Pausen erfordern, die längere Audio-Beschreibungen ermöglichen.",
    "1.2.8": "Eine Alternative für zeitbasierte Medien wird für alle vorgefertigten synchronisierten Medien und für alle vorgefertigten Video-Only-Medien bereitgestellt. Dies bedeutet ein vollständiges Texttranskript, das sowohl visuelle als auch auditive Elemente beschreibt.",
    "1.2.9": "Eine Alternative für zeitbasierte Medien wird bereitgestellt, die gleichwertige Informationen für Live-Audio-Only-Inhalte enthält. Dies kann beispielsweise durch Echtzeit-Untertitelung oder Transkription realisiert werden.",

    "9.1.3": "Inhalte so gestalten, dass sie in verschiedenen Präsentationsformen dargestellt werden können (z. B. einfacheres Layout), ohne dass Informationen oder Struktur verloren gehen. Dies erfordert die Verwendung semantischer Markup-Strukturen, die von assistiven Technologien interpretiert werden können.",
    "9.1.3.1a": "Überschriften müssen mit semantischen HTML-Tags (h1-h6) oder ARIA-Rollen korrekt ausgezeichnet sein, um die Struktur der Inhalte zugänglich zu machen.",
    "9.1.3.1b": "Listen müssen mit den HTML-Strukturelementen <ul>, <ol> oder <dl> ausgezeichnet sein, um eine zugängliche und logisch strukturierte Navigation zu ermöglichen.",
    "9.1.3.1c": "Eigenständige Zitate müssen mit dem HTML-Element <blockquote> ausgezeichnet sein, um eine klare semantische Struktur und Barrierefreiheit zu gewährleisten.",
    "9.1.3.1d": "Textabsätze müssen mit geeigneten HTML-Elementen wie <p> ausgezeichnet sein, doppelte <br>-Elemente für Umbrüche sollen vermieden und Hervorhebungen mit <strong> oder <em> gekennzeichnet werden.",
    "9.1.3.1e": "Datentabellen müssen klar strukturiert sein, Spalten- und Zeilenüberschriften mit <th> oder ARIA-Rollen ausgezeichnet und nicht für Layoutzwecke verwendet werden.",
    "9.1.3.1f": "In komplexen Tabellen müssen Überschriften und Datenzellen mit scope oder headers und id korrekt verknüpft sein, um eine eindeutige Zuordnung für Screenreader zu gewährleisten.",
    "9.1.3.1g": "Tabellen sollten nicht für Layoutzwecke verwendet werden, und falls doch, dürfen keine semantischen Markup-Elemente wie th, caption, summary, headers oder id enthalten sein.",
    "9.1.3.1h": "Beschriftungen von Formularelementen müssen programmatisch verknüpft sein, z. B. über label mit for-Attribut, aria-labelledby oder fieldset mit legend, damit Screenreader sie korrekt erfassen können.",
    "9.1.3.2": "Die Lese- und Navigationsreihenfolge (bestimmt durch Code-Reihenfolge) muss logisch und intuitiv sein. Die Reihenfolge der Seiteninhalte muss unabhängig von der visuellen Darstellung verständlich sein, sodass Screenreader-Nutzende die Inhalte in einer sinnvollen Abfolge erfassen können.",
    "9.1.3.3": "Verweise auf Inhalte dürfen nicht ausschließlich über sensorische Merkmale wie Farbe, Form oder Position erfolgen, sondern müssen auch textliche Hinweise enthalten, die unabhängig von der Sinneswahrnehmung verständlich sind.",
    "9.1.3.4": "Webinhalte müssen sowohl im Hoch- als auch im Querformat nutzbar sein, es sei denn, eine bestimmte Ausrichtung ist für den Inhalt zwingend erforderlich.",
    "9.1.3.5": "",
    "1.3.6": "Bei Inhalten, die mit Markup-Sprachen umgesetzt sind, kann der Zweck von Benutzeroberflächenkomponenten, Symbolen und Bereichen programmatisch ermittelt werden.",

    "9.1.4": "Benutzern das Sehen und Hören von Inhalten erleichtern, einschließlich der Trennung von Vorder- und Hintergrund. Dies umfasst ausreichende Kontraste, Steuerungsmöglichkeiten für Audio und Anpassbarkeit der Darstellung.",
    "9.1.4.1": "Informationen dürfen nicht ausschließlich über Farben vermittelt werden, sondern müssen auch durch Text oder Symbole erkennbar sein. Links sollten einen Luminanzkontrast von mindestens 3:1 zum umgebenden Text haben und eine zusätzliche Unterscheidung (z.B. Unterstreichung) beim Hover oder Fokus bieten.",
    "9.1.4.2": "Automatisch abgespielte Audioinhalte müssen abschaltbar sein oder eine Möglichkeit zur Lautstärkeregelung bieten.",
    "9.1.4.3": "Textinhalte müssen ein Kontrastverhältnis von mindestens 4,5:1 zum Hintergrund haben. Großer Text (über 18 Punkt oder 14 Punkt fett) benötigt ein Kontrastverhältnis von mindestens 3:1. Dies verbessert die Lesbarkeit für alle Nutzer, insbesondere für Menschen mit Sehbehinderungen.",
    "9.1.4.4": "Textinhalte müssen ohne Verlust von Funktionalität oder Lesbarkeit auf bis zu 200% vergrößert werden können.",
    "9.1.4.5": "Schriftgrafiken sollten vermieden werden, wenn der gleiche Inhalt auch als echter Text darstellbar ist. Falls sie verwendet werden, müssen sie eine hohe Qualität aufweisen und anpassbar sein, um die Barrierefreiheit sicherzustellen.",
    "1.4.6": "Text und Bilder von Text müssen ein Kontrastverhältnis von mindestens 7:1 zum Hintergrund haben, um auch für Menschen mit Sehschwäche gut lesbar zu sein.",
    "1.4.7": "Audiodateien, die hauptsächlich Sprache enthalten, dürfen keine störenden Hintergrundgeräusche haben oder müssen eine Möglichkeit bieten, diese abzuschalten oder zu reduzieren.",
    "1.4.8": "Textblöcke müssen so gestaltet sein, dass Nutzende Einstellungen wie Zeilenhöhe, Zeichenabstand und Absätze individuell anpassen können, um die Lesbarkeit zu verbessern.",
    "1.4.9": "Bilder von Text sollten vermieden werden, außer wenn sie aus dekorativen Gründen oder zur Übermittlung einer spezifischen visuellen Darstellung unerlässlich sind.",
    "9.1.4.10": "Inhalte müssen sich an verschiedene Bildschirmgrößen anpassen lassen, ohne dass horizontales Scrollen erforderlich ist.",
    "9.1.4.11": "Interaktive grafische Elemente müssen ein ausreichend starkes Kontrastverhältnis zum Hintergrund haben, um gut erkennbar zu sein.",
    "9.1.4.12": "Texte müssen so gestaltet sein, dass Nutzende den Abstand zwischen Buchstaben, Zeilen und Wörtern anpassen können, ohne dass der Inhalt unleserlich wird.",
    "9.1.4.13": "Wenn Inhalte durch Interaktionen (z. B. Hover oder Fokus) eingeblendet werden, muss es eine Möglichkeit geben, sie zu schließen oder weiterhin zu nutzen, ohne sie versehentlich zu verlieren.",

    "9.2.1": "Alle Funktionen müssen ohne Maus nutzbar sein, sodass auch Nutzer mit motorischen Einschränkungen problemlos navigieren können. Die Implementierung darf nicht mit bestehenden Tastaturbefehlen von Browsern oder assistiven Technologien in Konflikt geraten.",
    "9.2.1.1": "Alle Funktionen müssen über eine Tastatur erreichbar sein, ohne dass eine Maus oder ein Touchscreen erforderlich ist. Seitenspezifische Tastaturkurzbefehle und Accesskeys sollten nicht mit bestehenden Browser- und Screenreader-Shortcuts in Konflikt stehen.",
    "9.2.1.2": "Nutzer dürfen nicht in einer Oberfläche gefangen sein und müssen jederzeit mit der Tab-Taste oder ähnlichen Methoden die Navigation fortsetzen können.",
    "2.1.3": "Jede Funktionalität der Seite muss über eine Tastatur steuerbar sein, ohne zeitliche Einschränkungen für Eingaben.",
    "9.2.1.4": "Wenn eine Webseite Tastaturkürzel anbietet, müssen diese abschaltbar oder anpassbar sein, um versehentliche Eingaben zu vermeiden.",

    "9.2.2": "Benutzer müssen genügend Zeit haben, um Inhalte zu lesen oder Aktionen auszuführen, ohne dass Zeitlimits sie daran hindern.",
    "9.2.2.1": "Nutzer müssen die Möglichkeit haben, Zeitlimits zu verlängern oder zu deaktivieren, sofern diese nicht sicherheitskritisch sind. Ausnahmen gelten für Echtzeit-Ereignisse (z.B. Auktionen) und wenn die Zeitbegrenzung länger als 20 Stunden beträgt. Bei automatischen Weiterleitungen müssen Nutzer informiert und die Möglichkeit zum Abbruch erhalten.",
    "9.2.2.2": "Automatisch ablaufende Animationen oder bewegte Inhalte müssen pausierbar, stoppbar oder ausblendbar sein.",
    "2.2.3": "Timing ist kein wesentlicher Bestandteil des Ereignisses oder der Aktivität, außer bei nicht-interaktiven synchronisierten Medien und Echtzeitereignissen.",
    "2.2.4": "Unterbrechungen können vom Benutzer verschoben oder unterdrückt werden, außer bei Notfällen.",
    "2.2.5": "Wenn eine authentifizierte Sitzung abläuft, kann der Benutzer die Aktivität nach der erneuten Authentifizierung ohne Datenverlust fortsetzen.",
    "2.2.6": "Benutzer werden über die Dauer der Inaktivität gewarnt, die zum Verlust von Daten führen könnte, es sei denn, die Daten werden länger als 20 Stunden gespeichert.",

    "9.2.3": "Inhalte dürfen nicht bekanntermaßen Anfälle oder andere starke körperliche Reaktionen auslösen.",
    "9.2.3.1": "Kein Seiteninhalt darf mehr als dreimal pro Sekunde flackern, blitzen oder blinken, es sei denn, der blitzende Inhalt ist ausreichend klein, die Blitze haben geringen Kontrast und enthalten nicht zu viel Rot. Diese Einschränkung ist wichtig, um photosensitive Epilepsie und andere negative physische Reaktionen zu vermeiden.",
    "2.3.2": "Webseiten enthalten keine Elemente, die mehr als dreimal pro Sekunde blinken.",
    "2.3.3": "Bewegungsanimationen, die durch Interaktion ausgelöst werden, können deaktiviert werden, es sei denn, sie sind für die Funktionalität oder die übermittelte Information wesentlich.",

    "9.2.4": "Möglichkeiten bereitstellen, um Benutzern das Navigieren, Finden von Inhalten und Bestimmen ihrer Position zu erleichtern.",
    "9.2.4.1": "Nutzer müssen die Möglichkeit haben, sich schnell durch den Inhalt zu bewegen, indem sie Navigationselemente oder Sprungmarken nutzen können. Ein 'Skip to main content'-Link oder eine angemessene Überschriftenstruktur kann als Möglichkeit zum Überspringen von wiederkehrenden Blöcken dienen. Bei Frames sollte eine entsprechende Titel-Struktur vorhanden sein, die ein Überspringen ermöglicht.",
    "9.2.4.2": "Jede Seite muss einen aussagekräftigen Titel haben, damit Nutzer den Zweck der Seite schnell erfassen können.",
    "9.2.4.3": "Die Reihenfolge des Tastaturfokus muss logisch und vorhersehbar sein, um eine einfache Navigation zu ermöglichen.",
    "9.2.4.4": "Links müssen verständlich und aussagekräftig formuliert sein, damit Nutzer ihr Ziel ohne Kontext erraten können.",
    "9.2.4.5": "Nutzer sollten über mindestens zwei verschiedene Möglichkeiten verfügen, auf Inhalte zuzugreifen. Dies kann durch mindestens zwei der folgenden Methoden erreicht werden: eine Liste verwandter Seiten, ein Inhaltsverzeichnis, eine Sitemap, eine Suchfunktion oder eine Liste aller verfügbaren Webseiten.",
    "9.2.4.6": "Überschriften und Beschriftungen müssen klar und informativ sein, um Nutzern die Orientierung innerhalb der Inhalte zu erleichtern.",
    "9.2.4.7": "Die aktuelle Position des Tastaturfokus muss für den Nutzer stets erkennbar sein, damit eine intuitive Navigation gewährleistet wird.",
    "2.4.8": "Informationen über die Position des Benutzers innerhalb einer Reihe von Webseiten sind verfügbar.",
    "2.4.9": "Ein Mechanismus ist verfügbar, um den Zweck jedes Links anhand des Link-Textes allein zu identifizieren, außer wenn der Zweck für die Allgemeinheit mehrdeutig wäre.",
    "2.4.10": "Abschnittsüberschriften werden zur Strukturierung des Inhalts verwendet.",
    "2.4.11": "Wenn eine Benutzeroberflächenkomponente den Tastaturfokus erhält, ist sie nicht vollständig durch vom Autor erstellten Inhalt verdeckt.",
    "2.4.12": "Wenn eine Benutzeroberflächenkomponente den Tastaturfokus erhält, wird kein Teil der Komponente durch vom Autor erstellten Inhalt verdeckt.",
    "2.4.13": "Wenn der Tastaturfokus sichtbar ist, erfüllt ein Bereich der Fokusanzeige alle folgenden Kriterien: ...",

    "9.2.5": "Benutzern die Bedienung von Funktionen durch verschiedene Eingaben über die Tastatur hinaus erleichtern.",
    "9.2.5.1": "Wenn eine Website komplexe Zeiger-Gesten wie Wischen oder Zwei-Finger-Zoom nutzt, müssen alternative einfache Eingabemöglichkeiten bereitgestellt werden.",
    "9.2.5.2": "Benutzer müssen die Möglichkeit haben, versehentlich ausgeführte Zeigergesten-Eingaben rückgängig zu machen oder abzubrechen.",
    "9.2.5.3": "Wenn eine interaktive Komponente eine sichtbare Beschriftung hat, muss diese mit ihrem zugänglichen Namen übereinstimmen, damit Screenreader-Nutzer die Funktion verstehen.",
    "9.2.5.4": "Wenn eine Website Bewegungssensoren oder Gerätedrehungen als Eingabe nutzt, müssen alternative Bedienmöglichkeiten bereitgestellt werden.",
    "2.5.5": "Das Ziel für Zeigereingaben hat eine Größe von mindestens 44 x 44 CSS-Pixel, außer wenn: ...",
    "2.5.6": "Webinhalte schränken die Nutzung von Eingabemodalitäten auf einer Plattform nicht ein, es sei denn, die Einschränkung ist wesentlich, erforderlich, um die Sicherheit des Inhalts zu gewährleisten, oder notwendig, um Benutzereinstellungen zu respektieren.",
    "2.5.7": "Alle Funktionen, die eine Ziehbewegung erfordern, können auch mit einem einzelnen Zeiger ohne Ziehen ausgeführt werden, es sei denn, das Ziehen ist wesentlich oder wird vom Benutzeragenten gesteuert.",
    "2.5.8": "Das Ziel für Zeigereingaben hat eine Größe von mindestens 44 x 44 CSS-Pixel, außer wenn: ...",

    "9.3.1": "Textinhalte lesbar und verständlich machen.",
    "9.3.1.1": "Die Hauptsprache der Seite muss im HTML-Code korrekt mit dem lang-Attribut angegeben sein (z.B. <html lang=\"de\">), damit Screenreader und andere Hilfstechnologien den Inhalt in der richtigen Sprache wiedergeben können.",
    "9.3.1.2": "Wenn ein Textabschnitt oder einzelne Wörter in einer anderen Sprache als der Hauptsprache verfasst sind, müssen sie entsprechend ausgezeichnet werden, damit assistive Technologien sie korrekt interpretieren können.",
    "3.1.3": "Ein Mechanismus ist verfügbar, um spezifische Definitionen für Wörter oder Phrasen bereitzustellen, die in einer ungewöhnlichen oder eingeschränkten Weise verwendet werden, einschließlich Fachjargon und Redewendungen.",
    "3.1.4": "Ein Mechanismus zur Identifikation der ausgeschriebenen Form oder Bedeutung von Abkürzungen ist verfügbar.",
    "3.1.5": "Wenn der Text ein höheres Leseverständnis als das Sekundarschulniveau erfordert, ist ergänzender Inhalt oder eine verständlichere Version verfügbar.",
    "3.1.6": "Ein Mechanismus ist verfügbar, um die spezifische Aussprache von Wörtern zu identifizieren, wenn deren Bedeutung im Kontext ohne Kenntnis der Aussprache mehrdeutig wäre.",

    "9.3.2": "Webseiten so gestalten, dass sie in vorhersehbarer Weise erscheinen und funktionieren.",
    "9.3.2.1": "Das Setzen des Fokus auf ein Element darf nicht unerwartet zu einer Kontextänderung führen, wie z. B. das automatische Absenden eines Formulars oder das Öffnen eines neuen Fensters.",
    "9.3.2.2": "Das Ändern einer Eingabe, z. B. das Auswählen eines Dropdown-Menüpunkts, darf nicht automatisch eine unerwartete Aktion auslösen, wie das Absenden eines Formulars oder das Navigieren zu einer neuen Seite, es sei denn, der Nutzer wird im Voraus darüber informiert. Solche Änderungen können für Menschen mit Behinderungen verwirrend oder desorientierend sein.",
    "9.3.2.3": "Navigationsmechanismen, die auf mehreren Seiten einer Website wiederholt verwendet werden, sollten in ihrer Reihenfolge und Platzierung konsistent sein, um die Benutzerfreundlichkeit zu verbessern.",
    "9.3.2.4": "Bedienelemente mit gleicher Funktionalität sollten über eine einheitliche Bezeichnung verfügen, um Verwirrung bei Nutzern zu vermeiden.",
    "3.2.5": "Änderungen des Kontexts werden nur auf Anforderung des Benutzers ausgelöst oder ein Mechanismus ist verfügbar, um solche Änderungen zu deaktivieren.",
    "3.2.6": "Wenn eine Webseite eine der folgenden Hilfemechanismen enthält, und diese Mechanismen auf mehreren Webseiten einer Website wiederholt werden, erscheinen sie in derselben Reihenfolge: ...",

    "9.3.3": "Benutzern helfen, Fehler zu vermeiden und zu korrigieren.",
    "9.3.3.1": "Wenn ein Nutzer einen Fehler bei der Eingabe macht, muss das System diesen erkennen und eine entsprechende Rückmeldung geben. Pflichtfelder oder Formularelemente, die ein bestimmtes Format oder einen bestimmten Wert erfordern, sollten diese Information innerhalb des Labels oder (falls kein Label vorhanden ist) im title-Attribut des Elements bereitstellen. Fehlermeldungen sollten klar, intuitiv und barrierefrei sein.",
    "9.3.3.2": "Alle Formularelemente müssen eine verständliche und zugängliche Beschriftung haben, sodass Nutzer wissen, welche Eingaben erforderlich sind.",
    "9.3.3.3": "Wenn Nutzer Eingabefehler machen, sollten sie durch Hinweise oder Vorschläge unterstützt werden, um die Fehler zu korrigieren.",
    "9.3.3.4": "Bei kritischen Eingaben, wie rechtlichen, finanziellen oder personenbezogenen Daten, sollten Schutzmaßnahmen implementiert werden. Wenn der Nutzer rechtliche, finanzielle oder Testdaten ändern oder löschen kann, müssen diese Änderungen/Löschungen rückgängig machbar, verifizierbar oder bestätigungspflichtig sein, um versehentliche Fehleingaben zu vermeiden.",
    "3.3.5": "Nutzer müssen eine kontextsensitive Hilfe erhalten, die ihnen das korrekte Ausfüllen von Formularen erleichtert.",
    "3.3.6": "Für Webseiten, auf denen Benutzer Informationen übermitteln müssen, trifft mindestens eine der folgenden Bedingungen zu: ...",
    "3.3.7": "Informationen, die bereits vom Benutzer eingegeben oder bereitgestellt wurden, müssen nicht erneut eingegeben werden, außer: ...",
    "3.3.8": "Eine kognitive Funktion wie das Merken eines Passworts oder das Lösen eines Rätsels ist nicht erforderlich, es sei denn, eine alternative Authentifizierungsmethode oder eine unterstützende Funktion ist verfügbar.",
    "3.3.9": "Eine kognitive Funktion wie das Merken eines Passworts oder das Lösen eines Rätsels ist nicht erforderlich, es sei denn, eine alternative Authentifizierungsmethode oder eine unterstützende Funktion ist verfügbar.",

    "9.4.1": "Die Kompatibilität mit aktuellen und zukünftigen Benutzeragenten, einschließlich unterstützender Technologien, maximieren.",
    "9.4.1.1": "Die Syntax von HTML, ARIA und anderen Markup-Sprachen sollte korrekt sein, um die Kompatibilität mit assistiven Technologien zu gewährleisten. Signifikante HTML/XHTML-Validierungs-/Parsing-Fehler sollten vermieden werden. Die Validierung kann mit Tools wie dem W3C-Validator (http://validator.w3.org) überprüft werden. Hinweis: Diese Anforderung wurde in WCAG 2.1 als eigenständige Regel entfernt.",
    "9.4.1.2": "Interaktive Elemente wie Schaltflächen oder Formulare müssen ihren Namen, ihre Rolle und ihren aktuellen Wert programmatisch bereitstellen, damit assistive Technologien sie korrekt interpretieren können. Markup sollte in einer Weise verwendet werden, die Barrierefreiheit fördert, einschließlich der Befolgung von HTML/XHTML-Spezifikationen und der angemessenen Verwendung von Formularen, Formular-Labels, Frame-Titeln usw.",
    "9.4.1.3": "Dynamische Statusmeldungen (z. B. Erfolgsmeldungen, Fehlermeldungen oder Ladezustände) müssen ohne Fokuswechsel von assistiven Technologien erkennbar sein.",

    "11.7": "Systeme sollten die individuellen Einstellungen von Nutzern unterstützen, um eine barrierefreie Nutzung zu ermöglichen.",
    "11.7.1": "Nutzer müssen die Möglichkeit haben, Einstellungen wie Schriftgröße, Kontraste oder Farbmodi individuell anzupassen.",

    "11.8": "Werkzeuge zur Inhaltserstellung sollten barrierefreie Funktionen bereitstellen, um inklusive digitale Inhalte zu gewährleisten.",
    "11.8.2": "Autorenwerkzeuge müssen Funktionen bieten, die es ermöglichen, barrierefreie Inhalte zu erstellen und bestehende Inhalte auf Barrierefreiheit zu prüfen.",
    "11.8.3": "Wenn Inhalte in andere Formate konvertiert werden, müssen Barrierefreiheitsinformationen erhalten bleiben.",
    "11.8.4": "Autorenwerkzeuge sollten Unterstützung bieten, um Barrierefreiheitsprobleme automatisch zu erkennen und zu beheben.",
    "11.8.5": "Barrierefreie Vorlagen sollten bereitgestellt werden, um Nutzern eine einfache Erstellung zugänglicher Inhalte zu ermöglichen.",

    "12": "Benutzern und Entwicklern müssen klare Anleitungen und Unterstützung zur Barrierefreiheit zur Verfügung stehen.",
    "12.1.1": "Es muss dokumentiert sein, welche Barrierefreiheitsstandards eine Anwendung oder Website erfüllt und welche Einschränkungen bestehen.",
    "12.1.2": "Die bereitgestellte Dokumentation selbst muss barrierefrei zugänglich sein, z. B. durch Textalternativen, semantische Struktur und Tastaturbedienbarkeit.",
    "12.2.2": "Benutzer müssen bei Fragen oder Problemen zum Thema Barrierefreiheit technische Unterstützung erhalten können.",
    "12.2.3": "Kommunikationskanäle müssen so gestaltet sein, dass sie für alle Nutzergruppen verständlich und zugänglich sind, z. B. durch einfache Sprache, alternative Kontaktmöglichkeiten und Unterstützung für assistive Technologien.",
    "12.2.4": "Jegliche vom Support bereitgestellten Hilfestellungen müssen in barrierefreien Formaten zur Verfügung stehen."
}

